#include<stdio.h>
int main()
{
    //浮点型在内存中的存储方式
       //int n = 9;//整型形式放入
       // 9补码：0 00000000 00000000000000000001001
       
       //float* pfloat = (float*)&n;//(float*)强制类型转换
       //printf("n的值是：%d\n", n);//整型形式拿出，打印9
        
       //printf("*pfloat的值是：%f\n", *pfloat);//以浮点型形式拿出，打印0.000000。
        //S=0,E=1-127=-126,M=0.00000000000000000001001则*pfloat=(-1)^0*M*2^-126.保留6位就是0.000000
       

       //*pfloat = 9.0;//浮点型形式放入9.0
       //（-1）^0*1.001*2^3.S=0,M=1.001,E=3+127=130.
    //内存中是 ：0 10000010 00100000000000000000000
       
       //printf("n的值是：%d\n", n);//n的值是：1091567616
       //则直接读取，原反补相同： 0 10000010 00100000000000000000000转化为十进制就是1091567616
       
       //printf("*pfloat的值是：%f", *pfloat);//*pfloat的值是：9.000000
       //整型和浮点型在内存中存储方式不同。


    /*float f = 5.5;*/
    //5.5
    //101.1
    //(-1)^0*1.011*2^2
    // S=0,M=1.011,E=2（内存中放2+127=129）
    // 内存：S(0)E(100 0000 1)M(011 0000 0000 0000 0000 0000)16进制形式：0x40 b0 00 00
    //3.14
    //11.2^-1 2^-2……
	/*return 0;*/
    //指数E从内存取出分三种情况
    //E不全为0或不全为1：指数E的计算减去127（或1023）得到真实值，M前加上1.
    
    //E全为0：则真实的E=-127,v=+-1.xxx*2^-127=+-0,无限接近0.几乎不存在。
    //所以E全0时，规定浮点数的指数=1-127（或1023）即为真实值，有效数字M不要再加上第一位1，而是还原为0.xxxx的小数，
    //这样做为了表示+-0.以及接近于0的很小的数字。

    //E为全1：E真实值=128，则v表示+-无穷大数字
}