#include<stdio.h>

//指针占空间大小

//void test(int arr[])
//{
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	printf("%d", sz);//打印2
//	//Debug->配置管理器->平台：是64位，所以返回2（指针占8字节，32位指针占4字节）
//}
//int main()
//{
//	int arr[] = { 1,2,3,4,5, };
//	test(arr);
//	return 0;
//}

//字符指针
//int main()
//{
//	//char arr[] = "abcd";
//	//char* pc = arr;//数组名赋值给pc
//	//printf("%s\n", arr);
//	//printf("%s\n", pc);//由于将arr给pc了所以等价
//	////打印内容相同abcd
//
////另外的写法
//	char* p = "abcd";//不是将abcd放到p里。"abcd"是常量字符窜
//	//实际上是将a的地址放到p里了。
//	//*p = 'w';//这种做法是错误的由于abcd是常量字符窜所以不可改变。
//	//可以最好写成const char*p;
//	printf("%c\n", *p);//打印a
//	printf("%s\n", p);//从a这个地址开始打印字符窜，会打印出abcd
//	return 0;
//
//	
//}
// 

//指针数组 是数组,用来存放指针
//int main()
//{
//	int arr[] = { 1,2,3 };//整型数组
//	char ch[] = { 0 };//字符数组
//
//	int* parr[];//存放整型指针的数组
//	char pch[];//存放字符指针的数组
//	return 0;
//}

//指针数组用途

//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c = 30;
//	int d = 40;
//	int* arr[] = { &a,&b,&c,&d };//用指针数组存放a，b，c，d的地址
//	int i = 0;
//	for (i = 0; i < 4; i++)
//	{
//		printf("%d ", *(arr[i]));//arr[i]是元素地址
//	}
//	//打印10 20 30 40
//}//这种用法不常见

//用法
//int main()
//{
//	int arr1[] = { 1,2,3 ,4};
//	int arr2[] = { 2,3,4,5 };
//	int arr3[] = { 3,4,5 ,6};
//	 
//	int* parr[] = { arr1,arr2,arr3 };//用指针数组存放三个数组的首元素地址
//	//打印三个数组的元素
//	int i = 0;
//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ", *(parr[i]) + j);//arr[i]+j是arri[j]的地址
//
//		}
//		printf("\n");//打印完一个数组后换行
//		
//	}
//}


//数组指针：是指针用来存放数组的地址
//int main()
//{
//	//int* p = NULL;//p整型指针 指向整型的指针-可以存放整型的地址
//	//char* pc = NULL;//pc是字符指针-指向字符的指针-可以存放字符的地址
//
//	//数组指针-指向数组的指针-存放数组的地址
//	//int arr[10] = { 0 };
//	////arr-首元素地址。&arr[0]首元素地址。&arr数组地址
//	
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	////创建数组指针存放数组
//	////int *p[]：p先和[]结合。p是指针数组：存放指针元素的数组，int *p：p是整型指针存放整型地址的
//	//int(*p)[10] = &arr;// *先和p结合，p是指针（指向的是数组，数组的每个元素是int）.
//	////数组的地址要存起来。p就是数组指针
//
//	//下面哪个是数组指针
//	//	//int* p1[10];//p是数组
//	//	//int(*p2)[10];//p指针
//
//
//	char* arr[5];
//	char* (*pa)[5] = &arr;//pa是个变量名，*说明pa是指针，[5]表示pa指向的素组是5个元素，
//	//char*：说明pa指向的数组的元素类型是char*
//
//	int arr2[10] = { 0 };
//	int (*pa2)[10] = &arr2;
//
//	return 0;
//}

//数组指针用途arr[i]==*(arr+i)==*(p+i)==p[i]
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//
//	//int (*pa)[10] = &arr;//存放数组地址
//	////pa用途：打印数组元素*pa相当于得到整个数组（数组名）
//	//int i = 0;
//	//for (i = 0; i < 10; i++)
//	//{
//	//	printf("%d ", (*pa)[i]);//*pa==arr(arr是首元素地址）
//	//	//printf("%d ", *(*pa + i));同样打印1-10
//
//	//}//打印1-10
//	////用数组指针打印数组元素比较复杂
//
//	//优化方案
//	int* p = arr;
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *(p + i));
//	}//这种打印方式更加简洁
//
//	return 0;
//}


//一般来说数组指针常用在二维数组当中(二维数组传参首元素地址是第一行地址）
//void print1();
//void print2();
//
//int main()
//{
//	int arr[3][4] = { {1,3,4},{2,4,2},{1,2,4,5} };
//	//print1(arr, 3, 4);//打印数组元素（基础方法）.
//	printf("\n");
//	print2(arr, 3, 4);
//	//这里传数组名
//		//这里的数组名arr是首元素地址（除&arr，sizeof）
//		//这里的首元素不是1.
//		//把arr想象成一维数组，第一行是第一个元素，第二行是第二个元素，等。
//		//所以arr是第一行元素的地址（第一行的一维数组的地址）
//	return 0;
//}
//void print1(int arr[4][3], int x, int y)//这里的参数int arr[3][4]（数组形式）中括号内的数字不可以省略。
//{//参数时数组形式
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < x; i++)
//	{
//		for (j = 0; j < y; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");//打印完一行后换行
//	}
//}
//
//void print2(int(*p)[4], int x, int y)
////参数是指针形式
////这里的第一个参数是：数组指针（一维数组的地址）
////p每次加一就跳到下一行了
//{
//	int i = 0;
//	for (i = 0; i < x; i++)
//	{
//		int j = 0;
//		for (j = 0; j < y; j++)
//		{
//			/*printf("%d ", *((*p + i) + j));*/
//			printf("%d ",(*(p + i))[j]);//效果和上面一条语句相同*（p+i)找到这一行
//		}//*p+i是第i行数组(第i行数组首元素地址）,(*p+i)+j是第i行第j列元素地址
//		printf("\n");//打印完一行后换行
//	}
//}

//int arr[5];//arr是五个元素的整型数组
//int* parr1[10];//parr1是一个数组，数组有10个元素，元素类型是int*,所以parr1是指针数组
//int(*parr2)[10];//parr2是指针，指向的是数组，数组10个元素每个元素是整型，parr2是数组指针。
//
//int(*parr3[10])[5];//parr3和[]结合，parr3是数组有10个元素，
////每个元素是个数组指针，该数组指针指向的数组有5个元素每个元素是int(int(*)[5]是parr3的元素类型)。