#include<stdio.h>
//不同指针类型每次访问的空间不同
int main()
{
	int a = 0x11223344;//16进制数
	//16 进制数11223344在内存中是倒着存放的
	//前2个字节放的是44，后面依次放33 22 11
	char* p = (char*)&a;
	*p = 0;//将前两个字节值改为0
	printf("%x", a);//%x打印16进制数，打印11223300
	return 0;

	//int arr[] = { 1,3,5,7,9 };
	//int sz = sizeof(arr) / sizeof(arr[0]);
	//short* p = (short*)arr;//短整型指针每次访问2字节
	//int i = 0;
	////更改数组元素
	//for (i = 0; i < sz; i++)
	//{
	//	*(p + i) = 0;
	//	//将数组前10个字节内存中的值改为0
	//}
	////打印数组元素
	//for (i = 0; i < sz; i++)
	//{
	//	printf("%d ", arr[i]);
	//}
	////打印0 0 0 7 9
	//return 0;
}