#include<stdio.h>

//整型提升
int main()
{

	//char a = -1;//整型提升高位补1。补码：11111111 11111111 11111111 11111111
	//signed char b = -1;//有符号数高位补原符号位。补码：11111111 11111111 11111111 11111111
	//unsigned char c = -1;//无符号数，高位补0，补码：00000000 00000000 00000000 11111111
	//printf("%d %d %d", a, b, c);
	//打印-1 -1 255

	//char p = -128;
	//printf("%u\n", p);
	////%u打印10进制无符号数
	////-128原码10000000 00000000 00000000 10000000
	////反码    11111111 11111111 11111111 01111111
	////补码    11111111 11111111 11111111 10000000
	////截断10000000补1得11111111 11111111 11111111 10000000转化为10进制是4294967168
	//printf("%d", p);//若以整型打印，打印结果是-128

	//char q = 128;
	//printf("%u\n", q);//打印4294967168。128=127+1=-128
	//printf("%d\n", q);//打印-128

	//int i = -20;
	//unsigned int j = 10;
	//printf("%d\n", i + j);//打印-10.-20和10的补码进行异或运算，最后格式化为有符号数
	//int u = -20;
	//int v = 10;
	//printf("%d\n", u + v);//同样打印-10

	//unsigned int d;//0-1=-1,-1在无符号数里是个超大的数，此时d会一直大于零。死循环
	//int d;//只打印9,8，……，0
	//for (d = 9; d >= 0; d--)
	//{
	//	printf("%d ", d);
	//}

	//char a[1000];
	//int i;
	//for (i = 0; i < 1000; i++)
	//{
	//	a[i] = -1 - i;
	//}
	//printf("%d\n", strlen(a));//strlen(a)=255
	////char类整数取值范围是-128-127.当运行到-129时数据会转换成-128-127之间的数字存放在数组中
	////所以最后数组a中只存放李-128-127之间的255个数字
	
	//unsigned char i = 0;
	////char i = 0;同样陷入西死循环中
	//for (i = 0; i <= 255; i++)
	//{
	//	printf("hello ");//陷入死循环。char类型无符号数取值范围是0-255，所以i永远小于等于255
	//}

	//浮点型在内存中的存储方式
	//int n = 9;
	//float* pfloat = (float*)&n;
	//printf("n的值是：%d\n", n);//打印9
	//printf("*pfloat的值是：%f\n", *pfloat);//打印0.000000。整型和浮点型在内存中存储方式不同。
	//*pfloat = 9.0;
	//printf("n的值是：%d\n", n);//n的值是：1091567616
	//printf("*pfloat的值是：%f", *pfloat);//*pfloat的值是：9.000000
	//整型和浮点型在内存中存储方式不同。

}